/* eslint-disable react/no-unescaped-entities */
const Prose = () => {
    return (
        <article className="prose dark:prose-invert mx-auto">
            <p className="lead">
                تا به حال، تلاش برای استایل‌دهی به یک مقاله، سند، یا پست وبلاگ با استفاده از Tailwind کاری خسته‌کننده بوده که نیاز به دقت بالا در تایپوگرافی و بسیاری از CSS سفارشی پیچیده دارد.
            </p>
            <p>
                به‌طور پیش‌فرض، Tailwind تمام استایل‌های پیش‌فرض مرورگر را از پاراگراف‌ها، سرفصل‌ها، لیست‌ها و غیره حذف می‌کند. این موضوع برای ساخت رابط‌های کاربری اپلیکیشن بسیار مفید است زیرا زمان کمتری را برای لغو استایل‌های مربوط به user-agent صرف می‌کنید، اما زمانی که شما <em>واقعاً قصد دارید</em> محتوای واردشده از یک ویرایشگر متن غنی در CMS یا یک فایل markdown را استایل‌دهی کنید، می‌تواند شگفت‌انگیز و غیرقابل پیش‌بینی باشد.
            </p>
            <p>
                در واقع شکایات زیادی در این مورد دریافت می‌کنیم، با افرادی که به طور منظم از ما می‌پرسند:
            </p>
            <blockquote>
                <p>
                    چرا Tailwind استایل‌های پیش‌فرض روی عناصر <code>h1</code> من را حذف می‌کند؟ چطور می‌توانم این را غیرفعال کنم؟ منظورتان از این که تمام استایل‌های پایه دیگر را هم از دست می‌دهم چیست؟
                </p>
            </blockquote>
            <p>
                ما صدای شما را می‌شنویم، اما قانع نشده‌ایم که صرفاً غیرفعال کردن استایل‌های پایه ما همان چیزی است که شما واقعاً می‌خواهید. شما نمی‌خواهید هر بار که از یک عنصر <code>p</code> در رابط کاربری داشبوردتان استفاده می‌کنید، مجبور به حذف حاشیه‌های آزاردهنده شوید. و بعید می‌دانم واقعاً بخواهید پست‌های وبلاگتان از استایل‌های user-agent استفاده کنند — شما می‌خواهید آن‌ها <em>عالی</em> به نظر برسند، نه وحشتناک.
            </p>
            <p>
                پلاگین <code>@tailwindcss/typography</code> تلاش ماست برای ارائه چیزی که شما <em>واقعا</em> می‌خواهید، بدون هیچ‌کدام از معایب انجام کاری احمقانه مانند غیرفعال کردن استایل‌های پایه ما.
            </p>
            <p>
                این پلاگین یک کلاس جدید به نام <code>prose</code> اضافه می‌کند که می‌توانید آن را به هر بلوک محتوای HTML خام اعمال کنید و آن را به یک سند زیبا و با فرمت مناسب تبدیل کنید:
            </p>
            <pre>
                <code className="language-html">
                    {`<article className="prose">
    <h1>Garlic bread with cheese: What the science tells us</h1>
    <p>
        For years parents have espoused the health benefits of eating garlic bread with cheese to their
        children, with the food earning such an iconic status in our culture that kids will often dress
        up as warm, cheesy loaf for Halloween.
    </p>
    <p>
        But a recent study shows that the celebrated appetizer may be linked to a series of rabies cases
        springing up around the country.
    </p>
    <!-- ... -->
</article>`}
                </code>
            </pre>
            <p>
                برای اطلاعات بیشتر در مورد نحوه استفاده از این پلاگین و ویژگی‌های آن،{' '}
                <a href="https://github.com/tailwindcss/typography/blob/master/README.md">
                    مستندات را بخوانید
                </a>
                .
            </p>
            <hr />
            <h2>چه انتظاری از اینجا به بعد داشته باشیم</h2>
            <p>
                آنچه که در ادامه آمده صرفاً مجموعه‌ای از مزخرفاتی است که من برای تست پلاگین نوشتم. این شامل تمام عناصر تایپوگرافی معقولی است که به ذهنم رسید، مانند{' '}
                <strong>متن پررنگ</strong>، لیست‌های نامرتب، لیست‌های مرتب، بلوک‌های کد، نقل‌قول‌های بلوکی، <em>و حتی ایتالیک‌ها</em>.
            </p>
            <p>
                پوشش دادن تمام این موارد برای چند دلیل مهم است:
            </p>
            <ol>
                <li>ما می‌خواهیم همه چیز به طور پیش‌فرض خوب به نظر برسد.</li>
                <li>
                    در واقع تنها دلیل اول است، هدف اصلی پلاگین همین است.
                </li>
                <li>
                    البته یک دلیل فرضی سوم هم داریم که لیست با سه آیتم از لیست با دو آیتم واقعی‌تر به نظر می‌رسد.
                </li>
            </ol>
            <p>حالا قصد داریم یک استایل دیگر برای عنوان آزمایش کنیم.</p>
            <h3>تایپوگرافی باید آسان باشد</h3>
            <p>
                پس این یک عنوان برای شماست — با کمی شانس اگر کارمان را درست انجام داده باشیم، این باید به طور معقولی به نظر برسد.
            </p>
            <p>چیزی که یک فرد خردمند یک بار به من گفت درباره تایپوگرافی این بود که:</p>
            <blockquote>
                <p>
                    تایپوگرافی خیلی مهم است اگر نمی‌خواهید کارهای شما شبیه زباله به نظر برسد. آن را خوب بسازید تا بد نباشد.
                </p>
            </blockquote>
            <p>
                احتمالاً مهم است که تصاویر به طور پیش‌فرض اینجا به خوبی به نظر برسند:
            </p>
            <figure>
                <img
                    src="https://images.unsplash.com/photo-1556740758-90de374c12ad?ixlib=rb-1.2.1&amp;ixid=eyJhcHBfaWQiOjEyMDd9&amp;auto=format&amp;fit=crop&amp;w=1000&amp;q=80"
                    alt=""
                />
                <figcaption>
                    برخلاف باور عمومی، Lorem Ipsum تنها یک متن تصادفی نیست. این متن ریشه در یک قطعه از ادبیات لاتین کلاسیک از سال ۴۵ قبل از میلاد دارد و بیش از ۲۰۰۰ سال قدمت دارد.
                </figcaption>
            </figure>
            <p>
                حالا قصد دارم یک مثال از یک لیست نامرتب نشان دهم تا مطمئن شویم که آن هم خوب به نظر می‌رسد:
            </p>
            <ul>
                <li>این اولین آیتم در این لیست است.</li>
                <li>در این مثال، ما موارد را کوتاه نگه می‌داریم.</li>
                <li>بعداً از آیتم‌های لیست طولانی‌تر و پیچیده‌تری استفاده خواهیم کرد.</li>
            </ul>
            <p>و این پایان این بخش است.</p>
            <h2>اگر عنوان‌ها را روی هم بچینیم چه می‌شود؟</h2>
            <h3>باید مطمئن شویم که آن هم خوب به نظر برسد.</h3>
            <p>
                گاهی اوقات شما عنوان‌هایی دارید که مستقیماً زیر هم قرار دارند. در این موارد، اغلب باید فاصله بالای عنوان دوم را برطرف کنید، زیرا معمولاً بهتر است عنوان‌ها به هم نزدیک‌تر از یک پاراگراف با یک عنوان باشند.
            </p>
            <h3>وقتی عنوان بعد از یک پاراگراف می‌آید …</h3>
            <p>
                وقتی یک عنوان بعد از یک پاراگراف می‌آید، ما به مقداری فضای بیشتر نیاز داریم، همانطور که قبلاً ذکر کردم. حالا بیایید ببینیم که یک لیست پیچیده‌تر چه شکلی خواهد بود.
            </p>
            <ul>
                <li>
                    <p>
                        <strong>
                            من اغلب این کار را می‌کنم که در موارد لیست، عنوان‌هایی داشته باشم.
                        </strong>
                    </p>
                    <p>
                        به دلایلی فکر می‌کنم این به نظر جالب می‌آید، که متاسفانه چون درست کردن استایل‌ها برای آن سخت است.
                    </p>
                    <p>
                        من اغلب دو یا سه پاراگراف در این آیتم‌های لیست دارم، بنابراین قسمت سخت این است که فاصله بین پاراگراف‌ها، عنوان آیتم لیست و جدا کردن آیتم‌های مختلف لیست را به درستی تنظیم کنیم. حقیقتاً این کار دشواری است، شما می‌توانید استدلال کنید که شاید نباید اینطور نوشت.
                    </p>
                </li>
                <li>
                    <p>
                        <strong>
                            چون این یک لیست است، من حداقل به دو آیتم نیاز دارم.
                        </strong>
                    </p>
                    <p>
                        من قبلاً در مورد کاری که انجام می‌دهم در آیتم قبلی توضیح داده‌ام، اما لیست اگر فقط یک آیتم داشته باشد، دیگر لیست نیست، و ما واقعاً می‌خواهیم این به نظر واقعی بیاید. به همین دلیل است که من این آیتم دوم را اضافه کرده‌ام تا وقتی استایل‌ها را می‌نویسم چیزی برای نگاه کردن داشته باشم.
                    </p>
                </li>
                <li>
                    <p>
                        <strong>
                            اضافه کردن یک آیتم سوم هم ایده بدی نیست.
                        </strong>
                    </p>
                    <p>
                        فکر می‌کنم احتمالاً استفاده از دو آیتم کافی بود، اما سه آیتم قطعاً بدتر نیست، و از آنجایی که به نظر می‌رسد در ساختن موارد تصادفی مشکلی ندارم، بهتر است آن را اضافه کنم.
                    </p>
                </li>
            </ul>
            <p>
                بعد از چنین لیستی معمولاً یک جمله یا پاراگراف پایانی دارم، چون پرش مستقیم به یک عنوان کمی عجیب به نظر می‌رسد.
            </p>
            <h2>کد باید به طور پیش‌فرض خوب به نظر برسد.</h2>
            <p>
                فکر می‌کنم بیشتر مردم از {' '}
                <a href="https://highlightjs.org/">highlight.js</a> یا {' '}
                <a href="https://prismjs.com/">Prism</a> یا چیزی مشابه استفاده خواهند کرد
                اگر بخواهند بلوک‌های کد خود را استایل‌دهی کنند، اما ضرری ندارد که آن‌ها به صورت پیش‌فرض خوب به نظر برسند، حتی بدون هایلایت کردن نحو (syntax highlighting).
            </p>
            <p>
                اینجا چیزی است که یک فایل پیش‌فرض <code>tailwind.config.js</code> به نظر می‌رسد در زمان نوشتن:
            </p>
            <pre>
                <code className="language-js">{`
	module.exports = {
		purge: [],
		theme: {
			extend: {},
		},
		variants: {},
		plugins: [],
	}
`}</code>
            </pre>
            <p>امیدوارم این به اندازه کافی خوب به نظر برسد.</p>
            <h3>نظر شما درباره لیست‌های تو در تو چیست؟</h3>
            <p>
                لیست‌های تو در تو معمولاً بد به نظر می‌رسند و به همین دلیل است که ویرایشگرهایی مثل Medium حتی اجازه نمی‌دهند شما از آنها استفاده کنید. اما فکر می‌کنم از آنجایی که بعضی از شما احتمالاً این کار را خواهید کرد، باید حداقل تلاش کنیم که این وضعیت کار کند.
            </p>
            <ol>
                <li>
                    <strong>لیست‌های تو در تو به ندرت ایده خوبی هستند.</strong>
                    <ul>
                        <li>
                            ممکن است فکر کنید که خیلی "منظم" هستید یا چیزی شبیه به آن، اما شما فقط یک شکل ناخوشایند روی صفحه ایجاد می‌کنید که خواندنش سخت است.
                        </li>
                        <li>
                            ناوبری تو در تو در رابط‌های کاربری هم ایده بدی است. سعی کنید هر چیزی را تا حد ممکن مسطح نگه دارید.
                        </li>
                        <li>
                            تو در تو کردن تعداد زیادی پوشه در کد منبع شما هم مفید نیست.
                        </li>
                    </ul>
                </li>
                <li>
                    <strong>
                        از آنجا که به موارد بیشتری نیاز داریم، در اینجا یک مورد دیگر است.
                    </strong>
                    <ul>
                        <li>
                            مطمئن نیستم که بخواهیم بیش از دو سطح عمق را استایل دهیم.
                        </li>
                        <li>
                            دو سطح از آن هم بیشتر است، سه سطح قطعاً ایده بدی است.
                        </li>
                        <li>
                            اگر چهار سطح تو در تو کنید، جای شما در زندان است.
                        </li>
                    </ul>
                </li>
                <li>
                    <strong>
                        دو مورد واقعاً یک لیست نیستند، سه مورد خوب هستند.
                    </strong>
                    <ul>
                        <li>
                            دوباره، لطفاً لیست‌ها را تو در تو نکنید اگر می‌خواهید مردم واقعاً محتوای شما را بخوانند.
                        </li>
                        <li>
                            هیچ‌کس نمی‌خواهد این را ببیند.
                        </li>
                        <li>
                            ناراحت هستم که باید حتی برای استایل دهی به این وقت بگذاریم.
                        </li>
                    </ul>
                </li>
            </ol>
            <p>
                مزاحم‌ترین چیزی که در مورد لیست‌ها در Markdown وجود دارد این است که {' '}
                <code>&lt;li&gt;</code> عناصر هیچ <code>&lt;p&gt;</code> فرزند ندارند، مگر اینکه چند پاراگراف در آیتم لیست باشد. این یعنی باید نگران استایل دهی به این وضعیت آزاردهنده هم باشم.
            </p>
            <ul>
                <li>
                    <p>
                        <strong>
                            به عنوان مثال، در اینجا یک لیست تو در تو دیگر است.
                        </strong>
                    </p>
                    <p>اما این بار با یک پاراگراف دوم.</p>
                    <ul>
                        <li>
                            این آیتم‌های لیست <code>&lt;p&gt;</code> تگ ندارند
                        </li>
                        <li>چون هر کدام تنها یک خط دارند</li>
                    </ul>
                </li>
                <li>
                    <p>
                        <strong>
                            اما در این آیتم دوم سطح اول، آنها خواهند داشت.
                        </strong>
                    </p>
                    <p>
                        این مخصوصاً آزاردهنده است به خاطر فاصله در این پاراگراف.
                    </p>
                    <ul>
                        <li>
                            <p>
                                همانطور که در اینجا می‌بینید، چون یک خط دوم اضافه کرده‌ام، این آیتم لیست حالا تگ <code>&lt;p&gt;</code> دارد.
                            </p>
                            <p>
                                این همان خط دومی است که دارم در موردش صحبت می‌کنم.
                            </p>
                        </li>
                        <li>
                            <p>
                                در نهایت در اینجا یک آیتم لیست دیگر است تا بیشتر شبیه به یک لیست باشد.
                            </p>
                        </li>
                    </ul>
                </li>
                <li>
                    <p>
                        یک آیتم لیست پایانی، اما بدون لیست تو در تو، چون چرا که نه؟
                    </p>
                </li>
            </ul>
            <p>و در نهایت یک جمله برای بستن این بخش.</p>
            <h2>عناصر دیگری هم داریم که باید استایل دهیم</h2>
            <p>
                تقریباً فراموش کرده بودم که لینک‌ها را ذکر کنم، مانند{' '}
                <a href="https://tailwindcss.com">
                    این لینک به وب‌سایت Tailwind CSS
                </a>
                . تقریباً آنها را آبی کردیم اما این دیگر قدیمی شده است، پس به رنگ خاکی تیره رفتیم، که حس بیشتری دارد.
            </p>
            <p>ما حتی استایل‌هایی برای جدول‌ها هم گنجانده‌ایم، نگاهی بیندازید:</p>
            <table>
                <thead>
                    <tr>
                        <th>کشتی‌گیر</th>
                        <th>مبدا</th>
                        <th>حرکت تمام‌کننده</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>Bret "The Hitman" Hart</td>
                        <td>Calgary, AB</td>
                        <td>Sharpshooter</td>
                    </tr>
                    <tr>
                        <td>Stone Cold Steve Austin</td>
                        <td>Austin, TX</td>
                        <td>Stone Cold Stunner</td>
                    </tr>
                    <tr>
                        <td>Randy Savage</td>
                        <td>Sarasota, FL</td>
                        <td>Elbow Drop</td>
                    </tr>
                    <tr>
                        <td>Vader</td>
                        <td>Boulder, CO</td>
                        <td>Vader Bomb</td>
                    </tr>
                    <tr>
                        <td>Razor Ramon</td>
                        <td>Chuluota, FL</td>
                        <td>Razor's Edge</td>
                    </tr>
                </tbody>
            </table>
            <p>
                همچنین باید اطمینان حاصل کنیم که کدهای درون‌خطی به درستی نمایش داده شوند، مثل زمانی که بخواهم در مورد عناصر <code>&lt;span&gt;</code> صحبت کنم یا اخبار خوب را درباره <code>@tailwindcss/typography</code> به شما بگویم.
            </p>
            <h3>
                گاهی اوقات حتی از <code>code</code> در عنوان‌ها استفاده می‌کنم
            </h3>
            <p>
                گرچه احتمالاً ایده خوبی نیست و در گذشته سختی‌هایی برای زیبا کردن آن داشتم. اما این ترفند{' '}
                <em>"کدها را در backticks قرار بده"</em> واقعاً خوب عمل می‌کند.
            </p>
            <p>
                چیز دیگری که در گذشته امتحان کرده‌ام این است که یک تگ <code>code</code>{' '}
                را داخل یک لینک قرار دهم، مثل زمانی که بخواهم در مورد مخزن{' '}
                <a href="https://github.com/tailwindcss/docs">
                    <code>tailwindcss/docs</code>
                </a>{' '}
                صحبت کنم. من زیاد از اینکه زیر backticks خط زیرین باشد خوشم نمی‌آید، اما قطعاً ارزش دیوانگی‌هایی که برای اجتناب از آن لازم است را ندارد.
            </p>
            <h4>
                هنوز از <code>h4</code> استفاده نکرده‌ایم
            </h4>
            <p>
                اما حالا استفاده کرده‌ایم. لطفاً از <code>h5</code> یا{' '}
                <code>h6</code> در محتوای خود استفاده نکنید، Medium تنها از دو سطح عنوان پشتیبانی می‌کند به دلایلی، حیوانات. من راستش فکر کردم که از یک عنصر شبه‌قبل <code>before</code> استفاده کنم تا اگر از <code>h5</code> یا <code>h6</code> استفاده کردید، به شما هشدار بدهم.
            </p>
            <p>
                ما این‌ها را از جعبه به طور پیش‌فرض استایل نمی‌دهیم زیرا عناصر <code>h4</code> آنقدر کوچک هستند که اندازه‌شان برابر با متن بدنه است. قرار است با یک <code>h5</code> چه کنیم، آن را کوچکتر از متن بدنه کنیم؟ نه مرسی.
            </p>
            <h3>اما هنوز باید در مورد عناوین پشته‌ای فکر کنیم.</h3>
            <h4>
                بیایید اطمینان حاصل کنیم که این را هم با عناصر <code>h4</code> خراب نکنیم.
            </h4>
            <p>
                اوه، امیدوارم که عناوین بالای این متن به خوبی استایل داده شده و زیبا به نظر برسند.
            </p>
            <p>
                بیایید یک پاراگراف پایانی اضافه کنیم تا کارها با یک بلوک متن به اندازه معقول تمام شود. نمی‌توانم توضیح دهم چرا می‌خواهم کارها اینطور تمام شوند اما باید فرض کنم چون فکر می‌کنم اگر یک عنوان خیلی نزدیک به انتهای سند باشد، چیزها عجیب یا نامتعادل به نظر می‌رسند.
            </p>
            <p>
                آنچه که من اینجا نوشته‌ام احتمالاً به اندازه کافی طولانی است، اما افزودن این جمله پایانی آسیبی نمی‌زند.
            </p>
        </article>
    )
}

export default Prose
