export const featuresList: {
    id: string
    description: Record<string, string>
}[] = [
    {
        id: 'taskManagement',
        description: {
            basic: 'مدیریت وظایف',
            standard: 'مدیریت وظایف',
            pro: 'مدیریت وظایف',
        },
    },
    {
        id: 'managementTools',
        description: {
            basic: 'ابزارهای مدیریت پایه',
            standard: 'ابزارهای مدیریت پیشرفته',
            pro: 'ابزارهای مدیریت پیشرفته',
        },
    },
    {
        id: 'reporting',
        description: {
            basic: 'تولید گزارش',
            standard: 'تولید گزارش',
            pro: 'تولید گزارشات دقیق',
        },
    },
    {
        id: 'support',
        description: {
            basic: 'پشتیبانی از طریق ایمیل',
            standard: 'پشتیبانی از طریق چت و ایمیل',
            pro: 'پشتیبانی 24/7 از طریق چت و ایمیل',
        },
    },
    {
        id: 'fileSharing',
        description: {
            basic: 'اشتراک‌گذاری فایل‌ها',
            standard: 'اشتراک‌گذاری فایل‌ها',
            pro: 'اشتراک‌گذاری فایل‌ها',
        },
    },
    {
        id: 'advancedSecurity',
        description: {
            basic: 'پروتکل‌های امنیتی پیشرفته',
            standard: 'پروتکل‌های امنیتی پیشرفته',
            pro: 'پروتکل‌های امنیتی پیشرفته',
        },
    },
    {
        id: 'customIntegrations',
        description: {
            basic: 'یکپارچه‌سازی با خدمات شخص ثالث',
            standard: 'یکپارچه‌سازی با خدمات شخص ثالث',
            pro: 'یکپارچه‌سازی با خدمات شخص ثالث',
        },
    },
]


export const questionList: Record<
    string,
    {
        title: string
        content: string
        defaultExpand: boolean
    }[]
> = {
    subscription: [
        {
            title: 'چگونه می‌توانم برای اشتراک ثبت‌نام کنم؟',
            content:
                'طرح مورد نظر خود را از بالا انتخاب کرده و دستورالعمل‌های روی صفحه را دنبال کنید تا حساب کاربری خود را ایجاد کرده و جزئیات پرداخت خود را وارد کنید.',
            defaultExpand: true,
        },
        {
            title: 'آیا می‌توانم اشتراکم را لغو کنم؟',
            content:
                'بله، شما این امکان را دارید که اشتراک خود را در هر زمان لغو کنید. برای لغو، کافی است وارد حساب کاربری خود شوید، به بخش "اشتراک" بروید و دستورالعمل‌ها را برای لغو طرح خود دنبال کنید. لغو شما در پایان دوره صورتحساب فعلی شما اعمال خواهد شد.',
            defaultExpand: false,
        },
        {
            title: 'آیا می‌توانم طرح اشتراکم را تغییر دهم؟',
            content:
                'بله، شما می‌توانید در هر زمان بین طرح‌های ماهانه و سالانه جابجا شوید. برای تغییر طرح اشتراک خود، وارد حساب کاربری خود شوید، به بخش "اشتراک" بروید، طرحی که می‌خواهید به آن تغییر دهید را انتخاب کنید و دستورالعمل‌ها را دنبال کنید. طرح جدید شما بلافاصله اعمال خواهد شد.',
            defaultExpand: false,
        },
        {
            title: 'آیا آزمایشی رایگان ارائه می‌دهید؟',
            content:
                'بله، ما یک دوره آزمایشی ۱۴ روزه رایگان برای کاربران جدید فراهم می‌کنیم. در طول این مدت، می‌توانید به تمامی ویژگی‌های طرح اشتراک ما دسترسی داشته باشید. اگر پس از دوره آزمایشی ادامه دهید، بر اساس طرحی که انتخاب کرده‌اید، هزینه از شما دریافت خواهد شد.',
            defaultExpand: false,
        },
        {
            title: 'چگونه متوجه شوم که اشتراکم در حال تمدید است؟',
            content:
                'چند روز قبل از تمدید اشتراک شما، یک ایمیل اطلاع‌رسانی دریافت خواهید کرد که شما را از شارژ آینده مطلع می‌کند و گزینه‌ای برای اعمال هرگونه تغییرات فراهم می‌آورد.',
            defaultExpand: false,
        },
        {
            title: 'آیا تخفیفی برای دانشجویان یا سازمان‌های غیرانتفاعی دارید؟',
            content:
                'بله، ما تخفیف‌های ویژه‌ای برای دانشجویان و سازمان‌های غیرانتفاعی ارائه می‌دهیم. لطفاً با تیم پشتیبانی ما تماس بگیرید و مستندات مربوطه را برای درخواست این تخفیف‌ها ارسال کنید.',
            defaultExpand: false,
        },
    ],
    billing: [
        {
            title: 'چه روش‌های پرداختی را می‌پذیرید؟',
            content:
                'ما سعی داریم فرآیند پرداخت را تا حد ممکن راحت کنیم و روش‌های مختلف پرداخت را قبول می‌کنیم. این روش‌ها شامل کارت‌های اعتباری و دبیت اصلی مانند ویزا، مسترکارت، و امریکن اکسپرس، و همچنین پی‌پال هستند. بسته به موقعیت شما، ممکن است روش‌های پرداخت منطقه‌ای اضافی نیز در دسترس باشند.',
            defaultExpand: true,
        },
        {
            title: 'اگر پرداخت من انجام نشد، چه می‌شود؟',
            content:
                'اگر پرداخت شما ناموفق باشد، ما از طریق ایمیل به شما اطلاع خواهیم داد. سپس یک دوره تنفس ۷ روزه برای به‌روزرسانی اطلاعات پرداخت خود خواهید داشت. اگر این مشکل پرداخت در این مدت حل نشود، اشتراک شما به طور موقت متوقف خواهد شد تا زمانی که پرداخت به درستی انجام شود.',
            defaultExpand: false,
        },
        {
            title: 'چگونه اطلاعات پرداخت خود را به‌روزرسانی کنم؟',
            content:
                'برای به‌روزرسانی اطلاعات پرداخت خود، وارد حساب کاربری خود شوید، به بخش "صورتحساب" بروید و جزئیات پرداخت جدید خود را وارد کنید. حتماً تغییرات را ذخیره کنید تا خدمات بدون وقفه ادامه یابد.',
            defaultExpand: false,
        },
        {
            title: 'آیا اگر اشتراکم را لغو کنم، بازپرداخت دریافت می‌کنم؟',
            content:
                'سیاست‌های بازپرداخت بسته به نوع اشتراک شما متفاوت است. برای طرح ماهانه، ما بازپرداختی ارائه نمی‌دهیم. اما برای طرح سالانه، اگر اشتراک خود را در طی ۳۰ روز اول لغو کنید، ممکن است واجد شرایط بازپرداخت نسبت به مدت باقی‌مانده باشید. لطفاً برای کمک به این فرآیند با تیم پشتیبانی ما تماس بگیرید.',
            defaultExpand: false,
        },
    ],
    others: [
        {
            title: 'چگونه می‌توانم با پشتیبانی مشتری تماس بگیرم؟',
            content:
                'تیم پشتیبانی مشتری ما برای کمک به هر گونه سوال یا مشکل شما در دسترس است. می‌توانید از طریق ایمیل به آدرس support@ecme.com، تماس با خط پشتیبانی ما به شماره ۱-۸۰۰-۱۲۳-۴۵۶۷، یا استفاده از ویژگی چت زنده در وب‌سایت ما با ما تماس بگیرید. ما متعهد به ارائه کمک سریع و مؤثر هستیم.',
            defaultExpand: true,
        },
        {
            title: 'چگونه می‌توانم جزئیات حساب خود را تغییر دهم؟',
            content:
                'برای به‌روزرسانی جزئیات حساب خود، وارد حساب کاربری خود شوید، به بخش "امنیت" بروید و تغییرات لازم را اعمال کنید. حتماً تغییرات خود را ذخیره کنید.',
            defaultExpand: false,
        },
        {
            title: 'آیا اطلاعات شخصی من امن است؟',
            content:
                'بله، ما امنیت اطلاعات شخصی شما را در اولویت قرار می‌دهیم. سایت ما از رمزنگاری و اقدامات امنیتی استاندارد صنعت استفاده می‌کند. برای جزئیات بیشتر در مورد نحوه محافظت از داده‌های شما، به سیاست حفظ حریم خصوصی ما مراجعه کنید.',
            defaultExpand: false,
        },
    ],
    
}
export const questionCategory: Record<string, string> = {
    subscription: 'جزئیات اشتراک',
    billing: 'صورتحساب و پرداخت‌ها',
    others: 'سایر',
}
