/* eslint-disable react/no-unescaped-entities */
const Updating = () => {
    return (
        <>
            <p>
                از آنجایی که پلتفرم شامل یک سیستم کنترل نسخه داخلی نیست، به‌روزرسانی قالب‌های شما می‌تواند چالش‌برانگیز باشد. با این حال، در اینجا چند نکته آورده شده است که به شما کمک می‌کند قالب‌های خود را به‌راحتی به‌روز نگه دارید.
            </p>
            <ul>
                <li>
                    قبل از شروع یک پروژه جدید، به میزبانی قالب اصلی در مخزن خود فکر کنید.
                </li>
                <li>
                    یک شاخه از مخزن ایجاد کنید و به‌عنوان فضای کاری خود از آن استفاده کنید.
                </li>
                <li>
                    هنگامی که به‌روزرسانی جدیدی منتشر می‌شود، محتوای نسخه جدید را به مخزن خود ارسال کنید.
                </li>
                <li>
                    شاخه فضای کاری خود را با شاخه اصلی ادغام کنید تا تغییرات جدید را اعمال کنید.
                </li>
            </ul>
        </>
    )
}

export default Updating
